Revit 2027 API
ScheduleSortGroupField(ScheduleFieldId) Constructor
 Creates a new ScheduleSortGroupField.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleSortGroupField(
	ScheduleFieldId fieldId
)
Public Sub New (
	fieldId As ScheduleFieldId
)
public:
ScheduleSortGroupField(
	ScheduleFieldId^ fieldId
)
new :
        fieldId : ScheduleFieldId -> ScheduleSortGroupField
Parameters
fieldId ScheduleFieldId
 The ID of the field that the schedule will be sorted or grouped by.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleSortGroupField Class
ScheduleSortGroupField Overload
Autodesk.Revit.DB Namespace